---
kind: method
id: M:Autodesk.Revit.DB.SymbolGeometryId.AsUniqueIdentifier
source: html/b3d48051-1d8f-b2bf-5051-87be9b032694.htm
---
# Autodesk.Revit.DB.SymbolGeometryId.AsUniqueIdentifier Method

Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.

## Syntax (C#)
```csharp
public string AsUniqueIdentifier()
```

## Returns
A string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.